app/controllers/books_controller.rb

  def create
  	@book = Book.new(book_params)
  	if @book.save(book_params)
  		flash[:notice] = "successfully"
  	redirect_to book_path(@book.id)
  else
  	@books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["created_at", "2019-11-26 09:30:39.024365"], ["updated_at", "2019-11-26 09:30:39.024365"]]
SELECT "books".* FROM "books"

  def update
  	book = Book.find(params[:id])
  	book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "xyzd"], ["updated_at", "2019-11-26 11:42:50.047886"], ["id", 5]]